"""
Модуль с текстовыми ответами бота
"""
import btn_text

MSG_START = f"""
Добро пожаловать в наш увлекательный Telegram-бот для изучения английского языка!
        🎉 Погрузитесь в мир слов и знаний! 🎉
Здесь вы сможете весело и интерактивно проверить свои знания английского языка, а также значительно расширить свой словарный запас.
 Мы предлагаем вам уникальную возможность учиться, играя! 
 🔤 Как это работает?
    * Вам будут предложены слова на русском языке.
    * Ваша задача — выбрать правильный перевод на английский из предложенных вариантов.
    * Каждое правильное решение приближает вас к новым уровням и открытиям!
💡 Почему стоит играть с нами?
    * Интерактивный подход: Учите язык в игровой форме, что делает процесс обучения более увлекательным и эффективным.
    * Разнообразие тем: Мы предлагаем слова из различных категорий — от повседневной лексики до специализированных терминов.
    * Достижения и награды: За успешные ответы вы будете получать баллы и открывать новые уровни, что добавляет элемент соревнования и мотивации!
🌟 Присоединяйтесь к нам и начните свое языковое приключение!
Каждый новый уровень — это шаг к вашему совершенствованию. Не упустите шанс стать мастером английского языка!

Готовы начать? Просто нажмите "Начать игру!" и погружайтесь в увлекательный мир слов! Этот текст создает более привлекательное 
и интерактивное впечатление о вашем боте, подчеркивая его образовательные возможности и элементы игры. 
Вы можете дополнительно адаптировать его в зависимости от особенностей вашего бота и целевой аудитории.

        Нажми на кнопку ниже, чтобы <b>{btn_text.BTN_STAR_GEME}</b>
"""

MSG_HELP = f"""
"🆘 Помощь"

"Привет! Я ваш помощник в игре. Вот несколько команд, которые вы можете использовать:"

"1. **/start** - Запустите бота и получите приветственное сообщение."

"2. **/help** - Получите информацию о доступных командах."

"3. {btn_text.BTN_STAR_GEME} - Начните игру и проверьте свои знания."        

"""
